package org.example;

public enum ImpulseCorner {
    /**
     * Задний нижний левый угол импульса
     */
    FFF,
    /**
     * Задний нижний правый угол импульса
     */
    FFT,
    /**
     *  Задний верхний левый угол импульса
     */
    FTF,
    /**
     * Задний верхний правый угол импульса
     */
    FTT,
    /**
     * Передний нижний левый угол импульса
     */
    TFF,
    /**
     * Передний нижний правый угол импульса
     */
    TFT,
    /**
     * Передний верхний левый угол импульса
     */
    TTF,
    /**
     * Передний верхний правый угол импульса
     */
    TTT
}
